chapter = "ch01"
chapter_name = "차원축소"

qs = ["Q. 신경망을 이용하여 분류 문제를 해결할 때 회귀문제를 해결할 때와 어떻게 달라지나요?",
    "Q. 두 번째 문제",
    "Q. 세 번째 문제",
    "Q. 네 번째 문제",
    "Q. 다섯 번째 문제"]

As = [
    """출력층 부분이 달라진다.<br>
            분류 문제를 풀 경우에는 출력층의 활성화 함수를 softmax로 그리고 노드의 개수는 분류하는 class의 개수로 설정해야한다.<br>
                회귀 문제를 풀 경우에는 출력층의 활성화 함수를 항등함수로 그리고 노드의 개수는 한 개로 설정해야한다.""",
                """가나다""",
                """가나다""",
                """가나다""",
                """가나다""",
]

QA = {
    "ch01": {
        "chapter": "ch01",
        "chapter_name": "차원축소",
        "Q": [
                "Q. 신경망을 이용하여 분류 문제를 해결할 때 회귀문제를 해결할 때와 어떻게 달라지나요?",
                "Q. 두 번째 문제",
                "Q. 세 번째 문제",
                "Q. 네 번째 문제",
                "Q. 다섯 번째 문제"
            ],
        "A": [
                """출력층 부분이 달라진다.<br>
                분류 문제를 풀 경우에는 출력층의 활성화 함수를 softmax로 그리고 노드의 개수는 분류하는 class의 개수로 설정해야한다.<br>
                회귀 문제를 풀 경우에는 출력층의 활성화 함수를 항등함수로 그리고 노드의 개수는 한 개로 설정해야한다.""",
                """가나다""",
                """가나다""",
                """가나다""",
                """가나다""",
            ]
    },
    "ch02": {
        "chapter": "ch02",
        "chapter_name": "군집화",
        "Q": [
                "Q. 2222신경망을 이용하여 분류 문제를 해결할 때 회귀문제를 해결할 때와 어떻게 달라지나요?",
                "Q. 두 번째 문제",
                "Q. 세 번째 문제",
                "Q. 네 번째 문제",
                "Q. 다섯 번째 문제"
            ],
        "A": [
                """출력층 부분이 달라진다.<br>
                분류 문제를 풀 경우에는 출력층의 활성화 함수를 softmax로 그리고 노드의 개수는 분류하는 class의 개수로 설정해야한다.<br>
                회귀 문제를 풀 경우에는 출력층의 활성화 함수를 항등함수로 그리고 노드의 개수는 한 개로 설정해야한다.""",
                """가나다""",
                """가나다""",
                """가나다""",
                """가나다""",
            ]
    }
}